[
    {
        "property_id": 1,
        "is_active": true,
        "price": 1000000,
        "list_date": "2019-03-10",
        "above_grade_sqft": 1500,
        "lot_size": 2000,
        "post_title": "Introducing Beautiful Townhouse for a Small Family in Upper East Side",
        "post_priority": 0,
        "description": "This lovely 2 bedroom townhouse is only a few steps away from the Bow River pathway and is nestled among beautiful garden pathways and minutes to downtown, The University of Calgary, and Foothills Hospital.",
        "is_commercial": false,
        "business": "",
        "num_of_buildings": 1,
        "is_residential": true,
        "residence_type": "Townhouse",
        "user": 1
    },
    {
        "property_id": 2,
        "is_active": true,
        "price": 900000,
        "list_date": "2019-03-10",
        "above_grade_sqft": 2500,
        "lot_size": 1500,
        "post_title": "A Magical Heritage House for a Large Family including Extended Families Like Even Your Third Cousins",
        "post_priority": 1,
        "description": "Updated character Elbow Park bungalow located on a large tree lot. Walking in to this home you are greeted with loads of light, brilliant refinished hardwood floors, sunroom, updated powder room, pot lighting, a living dining area open to an updated modern kitchen which includes a huge island, top of the line Stainless Steele appliances, and beautiful stone counter tops.",
        "is_commercial": false,
        "business": "",
        "num_of_buildings": 1,
        "is_residential": true,
        "residence_type": "House",
        "user": 1
    },
    {
        "property_id": 3,
        "is_active": true,
        "price": 800000,
        "list_date": "2019-03-08",
        "above_grade_sqft": 700,
        "lot_size": 0,
        "post_title": "A Cool Condo for an Urban Party Legend",
        "post_priority": 1,
        "description": "Located on the beautiful Bow River and within walking distance of Prince\\'s Island Park, Claire Bow Estates offers exceptional condominium living in Calgary. With the centre of commerce, downtown shopping, Stephen Avenue and restaurants all located within a few blocks. In winter, you can enjoy quick access through the downtown via the Plus 15 walkways. This elegant home boasts a spacious living room with marble gas fireplace, semi divided dining room area, large country style kitchen with granite counter-tops and an island with an electric cooktop.",
        "is_commercial": false,
        "business": "",
        "num_of_buildings": 1,
        "is_residential": true,
        "residence_type": "Condo",
        "user": 1
    },
    {
        "property_id": 4,
        "is_active": true,
        "price": 1,
        "list_date": "2019-03-06",
        "above_grade_sqft": 1000,
        "lot_size": 1800,
        "post_title": "An Affordable Home for Mordern Cost-conscious Living",
        "post_priority": 1,
        "description": "Your chance to own a home at an economical price! Located on one of the largest parcels in the complex so there is plenty of parking, a good-sized deck and fenced yard space.",
        "is_commercial": false,
        "business": "",
        "num_of_buildings": 1,
        "is_residential": true,
        "residence_type": "Mobile",
        "user": 1
    }
]